scripts/benchmark-exp-logs/hotel-reservation/hotel-reservation-tcpdump-benchmark-2-640.log
1Running 1m test @ http://frontend.hotel-res.svc.cluster.local:5000
  2 threads and 640 connections
  Thread calibration: mean lat.: 52.473ms, rate sampling interval: 220ms
  Thread calibration: mean lat.: 59.683ms, rate sampling interval: 233ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    70.49ms   97.45ms 462.85ms   88.19%
    Req/Sec    10.04k     1.41k   11.67k    92.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.82ms
 75.000%   68.74ms
 90.000%  200.83ms
 99.000%  462.85ms
 99.900%  644.61ms
 99.990%  800.26ms
 99.999%  864.26ms
100.000%  911.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.406     0.000000            1         1.00
       9.103     0.100000        99646         1.11
      15.855     0.200000       199158         1.25
      21.599     0.300000       298702         1.43
      27.183     0.400000       398424         1.67
      33.823     0.500000       497759         2.00
      37.951     0.550000       547499         2.22
      42.975     0.600000       597399         2.50
      49.215     0.650000       647056         2.86
      57.311     0.700000       696876         3.33
      68.735     0.750000       746673         4.00
      76.671     0.775000       771494         4.44
      87.231     0.800000       796395         5.00
     101.823     0.825000       821168         5.71
     123.711     0.850000       846061         6.67
     156.671     0.875000       870980         8.00
     177.535     0.887500       883382         8.89
     200.831     0.900000       895843        10.00
     224.383     0.912500       908300        11.43
     248.959     0.925000       920743        13.33
     274.175     0.937500       933248        16.00
     287.231     0.943750       939496        17.78
     301.055     0.950000       945624        20.00
     316.159     0.956250       951844        22.86
     332.799     0.962500       958065        26.67
     352.511     0.968750       964335        32.00
     363.519     0.971875       967412        35.56
     375.807     0.975000       970474        40.00
     389.119     0.978125       973581        45.71
     404.223     0.981250       976699        53.33
     421.375     0.984375       979831        64.00
     431.103     0.985938       981358        71.11
     442.367     0.987500       982945        80.00
     454.655     0.989062       984501        91.43
     468.735     0.990625       986047       106.67
     484.863     0.992188       987601       128.00
     493.823     0.992969       988369       142.22
     503.551     0.993750       989140       160.00
     515.583     0.994531       989919       182.86
     528.895     0.995313       990708       213.33
     544.767     0.996094       991465       256.00
     553.471     0.996484       991875       284.44
     561.663     0.996875       992246       320.00
     572.927     0.997266       992646       365.71
     584.703     0.997656       993040       426.67
     597.503     0.998047       993410       512.00
     604.671     0.998242       993612       568.89
     611.839     0.998437       993799       640.00
     622.079     0.998633       993995       731.43
     633.343     0.998828       994188       853.33
     646.143     0.999023       994386      1024.00
     653.823     0.999121       994488      1137.78
     662.015     0.999219       994577      1280.00
     673.791     0.999316       994677      1462.86
     686.079     0.999414       994771      1706.67
     699.903     0.999512       994871      2048.00
     708.095     0.999561       994918      2275.56
     719.359     0.999609       994968      2560.00
     727.039     0.999658       995016      2925.71
     735.231     0.999707       995064      3413.33
     747.007     0.999756       995111      4096.00
     755.711     0.999780       995135      4551.11
     762.879     0.999805       995161      5120.00
     772.095     0.999829       995184      5851.43
     780.799     0.999854       995208      6826.67
     791.039     0.999878       995235      8192.00
     795.135     0.999890       995244      9102.22
     802.303     0.999902       995256     10240.00
     811.519     0.999915       995268     11702.86
     818.687     0.999927       995281     13653.33
     825.855     0.999939       995293     16384.00
     829.439     0.999945       995299     18204.44
     833.535     0.999951       995306     20480.00
     835.583     0.999957       995311     23405.71
     840.703     0.999963       995317     27306.67
     844.287     0.999969       995323     32768.00
     845.823     0.999973       995326     36408.89
     847.359     0.999976       995329     40960.00
     852.479     0.999979       995334     46811.43
     856.575     0.999982       995335     54613.33
     861.695     0.999985       995340     65536.00
     861.695     0.999986       995340     72817.78
     862.719     0.999988       995341     81920.00
     864.255     0.999989       995343     93622.86
     866.303     0.999991       995344    109226.67
     877.567     0.999992       995346    131072.00
     879.615     0.999993       995347    145635.56
     879.615     0.999994       995347    163840.00
     880.639     0.999995       995348    187245.71
     883.199     0.999995       995349    218453.33
     894.463     0.999996       995350    262144.00
     894.463     0.999997       995350    291271.11
     894.463     0.999997       995350    327680.00
     898.559     0.999997       995351    374491.43
     898.559     0.999998       995351    436906.67
     902.143     0.999998       995352    524288.00
     902.143     0.999998       995352    582542.22
     902.143     0.999998       995352    655360.00
     902.143     0.999999       995352    748982.86
     902.143     0.999999       995352    873813.33
     911.871     0.999999       995353   1048576.00
     911.871     1.000000       995353          inf
#[Mean    =       70.488, StdDeviation   =       97.452]
#[Max     =      911.360, Total count    =       995353]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1179231 requests in 1.00m, 487.75MB read
Requests/sec:  19655.95
Transfer/sec:      8.13MB